
## Plan Result

[CI link](https://github.com/hikobend/aws-sample-architecture-1/actions/runs/5636494202)


<pre><code>Plan: 3 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.network.aws_vpc_endpoint.private_ec2_ssm[&#34;ec2messages&#34;]
  * module.network.aws_vpc_endpoint.private_ec2_ssm[&#34;ssm&#34;]
  * module.network.aws_vpc_endpoint.private_ec2_ssm[&#34;ssmmessages&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.network.aws_vpc_endpoint.private_ec2_ssm["ec2messages"] will be created
  + resource "aws_vpc_endpoint" "private_ec2_ssm" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = [
          + "sg-0159714433a727445",
        ]
      + service_name          = "com.amazonaws.ap-northeast-1.ec2messages"
      + state                 = (known after apply)
      + subnet_ids            = [
          + "subnet-0821c957f6d439a1a",
          + "subnet-0f676c6c810d0fbe4",
        ]
      + tags                  = {
          + "Name" = "dev-ec2messages"
        }
      + tags_all              = {
          + "Environment" = "dev"
          + "Name"        = "dev-ec2messages"
        }
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = "vpc-04006413e033326ec"

      + dns_options {
          + dns_record_ip_type                             = (known after apply)
          + private_dns_only_for_inbound_resolver_endpoint = (known after apply)
        }
    }

  # module.network.aws_vpc_endpoint.private_ec2_ssm["ssm"] will be created
  + resource "aws_vpc_endpoint" "private_ec2_ssm" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = [
          + "sg-0159714433a727445",
        ]
      + service_name          = "com.amazonaws.ap-northeast-1.ssm"
      + state                 = (known after apply)
      + subnet_ids            = [
          + "subnet-0821c957f6d439a1a",
          + "subnet-0f676c6c810d0fbe4",
        ]
      + tags                  = {
          + "Name" = "dev-ssm"
        }
      + tags_all              = {
          + "Environment" = "dev"
          + "Name"        = "dev-ssm"
        }
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = "vpc-04006413e033326ec"

      + dns_options {
          + dns_record_ip_type                             = (known after apply)
          + private_dns_only_for_inbound_resolver_endpoint = (known after apply)
        }
    }

  # module.network.aws_vpc_endpoint.private_ec2_ssm["ssmmessages"] will be created
  + resource "aws_vpc_endpoint" "private_ec2_ssm" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = [
          + "sg-0159714433a727445",
        ]
      + service_name          = "com.amazonaws.ap-northeast-1.ssmmessages"
      + state                 = (known after apply)
      + subnet_ids            = [
          + "subnet-0821c957f6d439a1a",
          + "subnet-0f676c6c810d0fbe4",
        ]
      + tags                  = {
          + "Name" = "dev-ssmmessages"
        }
      + tags_all              = {
          + "Environment" = "dev"
          + "Name"        = "dev-ssmmessages"
        }
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = "vpc-04006413e033326ec"

      + dns_options {
          + dns_record_ip_type                             = (known after apply)
          + private_dns_only_for_inbound_resolver_endpoint = (known after apply)
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```

</details>



## :warning: Warnings :warning:

```hcl
Warning: Argument is deprecated

  with module.network.module.network.aws_eip.nat,
  on .terraform/modules/network.network/main.tf line 1030, in resource "aws_eip" "nat":
1030:   vpc = true

use domain attribute instead

(and 2 more similar warnings elsewhere)

```



<!-- github-comment: {"Command":"plan","JobName":"terraform_plan","PRNumber":36,"Program":"tfcmt","SHA1":"874238bad9afcca8dae5a0115480eb5252f2c7d4","Vars":{},"WorkflowName":"dev plan"} -->